# SolidglassBumpAmount Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SolidGlass..::..SolidglassBumpAmount Property
SolidGlass Class See Also
---
The property labeled "Amount" from the "SolidGlass" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string SolidglassBumpAmount { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SolidglassBumpAmount As String
	Get
```

Visual C++
---
```text
public:
static property String^ SolidglassBumpAmount {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 2".
# See Also
SolidGlass Class
Autodesk.Revit.DB.Visual Namespace